uhnp/src/Catalogs/АналитическиеПанели/АналитическиеПанели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АналитическиеПанели</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.ПакетыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьЗаголовкиСтраниц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РазметкаПанели</name>
    <attributes>
      <name>ИмяСтраницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКолонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>EnumRef.ВидыЭлементовАналитическойПанели</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиЭлемента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяГруппыЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкрытьЗаголовокЭлемента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОбъекта</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗафиксироватьОтборы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтраницыПанели</name>
    <attributes>
      <name>ИмяСтраницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСтраницы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Видимость</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветФонаСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеИБ</name>
    <attributes>
      <name>ТипИБ</name>
      <type>
        <types>CatalogRef.ТипыБазДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.ВнешниеИнформационныеБазы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/АналитическиеПанели/Forms/ФормаРедактированияСвойствПанели/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Наименование 			= Параметры.Наименование;
    ИсточникДанных 			= Параметры.ИсточникДанных;
	ИсточникДанныхИсходный 	= Параметры.ИсточникДанных;

	Комментарий 			= Параметры.Комментарий;
    ИсходныйURLСхемы        = Параметры.URLСхемы;
	ЕстьЭлементыСНастройкой = Параметры.ЕстьЭлементыСНастройкой;
	
	ИнициализироватьСКДИсточника();

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСКДИсточника(СброситьНастройкиТекущейПанели = Ложь)
	
	//Получаем актуальную КД из пакета данных
	СхемаКомпоновкиДанныхИсточника  = ИсточникДанных.СхемаКомпоновкиДанныхпоУмолчанию.Получить();
	
	//Из сохраненной КД текущей панели нам нужны Поля итогов и Вычисляемые поля
	Если ЗначениеЗаполнено(ИсходныйURLСхемы) Тогда
		СхемаКомпоновкиДанныхПанели      = ПолучитьИзВременногоХранилища(ИсходныйURLСхемы);
    Иначе
		СхемаКомпоновкиДанныхПанели	      = Неопределено;
	КонецЕсли;	
	
	ПроверитьИзмененияПолей(СхемаКомпоновкиДанныхИсточника,СхемаКомпоновкиДанныхПанели);
		
	Если СброситьНастройкиТекущейПанели
		И НЕ СхемаКомпоновкиДанныхПанели = Неопределено Тогда
		
		//СхемаКомпоновкиДанныхПанели.ВычисляемыеПоля.Очистить();
		СхемаКомпоновкиДанныхПанели.ПоляИтога.Очистить();
		//СхемаКомпоновкиДанныхПанели.Параметры.Очистить();
		
	КонецЕсли;	

	
	Если НЕ СброситьНастройкиТекущейПанели
		//Перенесем вычисляемые поля и итоги 
		И НЕ  СхемаКомпоновкиДанныхПанели = Неопределено Тогда
			
		СхемаКомпоновкиДанныхИсточника.ПоляИтога.Очистить();
		
		Для Каждого тПоле Из СхемаКомпоновкиДанныхПанели.ПоляИтога Цикл
			
			нПоле = СхемаКомпоновкиДанныхИсточника.ПоляИтога.Добавить();
			заполнитьЗначенияСвойств(нПоле,тПоле);
			Для Каждого ИтогГруппировка Из тПоле.Группировки Цикл
				нПоле.Группировки.Добавить(ИтогГруппировка);
			КонецЦикла;	
			
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	Для Каждого тПоле Из СхемаКомпоновкиДанныхПанели.ВычисляемыеПоля Цикл
		
		нПоле = СхемаКомпоновкиДанныхИсточника.ВычисляемыеПоля.Добавить();
		заполнитьЗначенияСвойств(нПоле,тПоле);
		
	КонецЦикла;	
	
	Для Каждого тПоле Из СхемаКомпоновкиДанныхПанели.Параметры Цикл
		
		нПоле = СхемаКомпоновкиДанныхИсточника.Параметры.Добавить();
		заполнитьЗначенияСвойств(нПоле,тПоле);
		
	КонецЦикла;
	
	
	
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанныхИсточника,ЭтаФорма.УникальныйИдентификатор);	
	
	Попытка
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы));
	Исключение
		
		СообщениеПользователю = Новый СообщениеПользователю;
		
		СтрокаШаблона = Нстр("ru = 'При инициализации настроек источника данных возникла ошибка:
		|%1'");
		
		Если Не ПустаяСтрока(СтрокаШаблона) тогда			
			СообщениеПользователю.Текст = СтрШаблон(СтрокаШаблона, ОписаниеОшибки());
		КонецЕсли;
		
		СообщениеПользователю.Сообщить();		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		
	КонецПопытки;

	
КонецПроцедуры	

Процедура ПроверитьИзмененияПолей(СхемаКомпоновкиДанныхИсточника,СхемаКомпоновкиДанныхПанели); 
	
	Если СхемаКомпоновкиДанныхИсточника = Неопределено 
		ИЛИ СхемаКомпоновкиДанныхПанели = Неопределено Тогда		
		Возврат;	
	КонецЕсли;	
		
	//Есть в пакете, нет в панели
	Для Каждого СтрПоле Из СхемаКомпоновкиДанныхИсточника.НаборыДанных[0].Поля Цикл
		
		НайденноеПоле =  СхемаКомпоновкиДанныхПанели.НаборыДанных[0].Поля.Найти(СтрПоле.Поле); 
		Если НайденноеПоле  = Неопределено Тогда
			
			СтрокаШаблона = Нстр("ru = 'Поле источника %1 добавлено или изменено'");
			СтрокаШаблона = СтрШаблон(СтрокаШаблона,СтрПоле.Поле);
            ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрокаШаблона);
			
		ИначеЕсли НЕ НайденноеПоле.ТипЗначения = СтрПоле.ТипЗначения Тогда
			
			СтрокаШаблона = Нстр("ru = 'У Поля %1 изменился тип значения'");
			СтрокаШаблона = СтрШаблон(СтрокаШаблона,СтрПоле.Поле);
            ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрокаШаблона);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Для Каждого СтрПоле Из СхемаКомпоновкиДанныхПанели.НаборыДанных[0].Поля Цикл
		
		НайденноеПоле =  СхемаКомпоновкиДанныхИсточника.НаборыДанных[0].Поля.Найти(СтрПоле.Поле);  

		Если НайденноеПоле = Неопределено Тогда
			
			СтрокаШаблона = Нстр("ru = 'Поле источника %1 удалено или изменено'");
			СтрокаШаблона = СтрШаблон(СтрокаШаблона,СтрПоле.Поле);
            ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрокаШаблона);
				
		КонецЕсли;	
		
	КонецЦикла;	
		
КонецПроцедуры	



&НаКлиенте
Процедура Применить(Команда)
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнено наименование '"),,"Наименование");		
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИсточникДанных) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран источник данных '"),,"ИсточникДанных");		
		Возврат;
	КонецЕсли;
	
	Если ЕстьЭлементыСНастройкой 
		И ИсточникДанныхИсходный<>ИсточникДанных Тогда			
		ВопросПрименитьНовыйИсточник();	
	Иначе			
		Закрыть(ПодготовитьПараметры());	
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПрименитьНовыйИсточник()
	
	Оповещение = Новый ОписаниеОповещения("ВопросПрименитьНовыйИсточникЗавершение",ЭтаФорма);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'При изменении источника текущие настройки элементов панели, итогов и вычисляемых полей станут неактуальными, продолжить?'"), РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры


&НаКлиенте
Процедура ВопросПрименитьНовыйИсточникЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда				
		ИнициализироватьСКДИсточника(Истина);
		Закрыть(ПодготовитьПараметры());		
	КонецЕсли;		
			
КонецПроцедуры


Функция ПодготовитьПараметры() 
	
	 Возврат Новый Структура("URLСхемы,Наименование,Комментарий,ИсточникДанных"
	,ЗначениеВстрокуВнутр(ПолучитьИзВременногоХранилища(URLСхемы))
	,Наименование
	,Комментарий
	,ИсточникДанных)
	
КонецФункции	

&НаКлиенте
Процедура РедактироватьСхемуДанных(Команда)
				
	ОткрытьФормуНастройкиСтруктуры();
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиСтруктуры()
	
	ПараметрыФормы = ПодготовитьПараметрыДляВызоваФормыРедактирования(Ложь);
	ПараметрыФормы.Вставить("Источник",ИсточникДанных);
	ОткрытьФорму("Справочник.АналитическиеПанели.Форма.ФормаНастройкиСКД", ПараметрыФормы,  ЭтаФорма);

КонецПроцедуры

&НаСервере
Функция ПодготовитьПараметрыДляВызоваФормыРедактирования(РасширеннаяНастройка)
	
	Возврат Новый Структура("URLСхемы, КомпоновщикНастроек, НаименованиеОтчета"
							, URLСхемы
							, КомпоновщикНастроек
							, Наименование);
	
КонецФункции

&НаКлиенте
Процедура ПеречитатьНастройкиИсточника(Команда)
	
	ИнициализироватьСКДИсточника(Истина);
	ЭтаФорма.Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры
